Repository: ollenilsson1/labb2
Catalog: languages/plugins/woo-swish-e-commerce-*.po
Languages: sv_se

source: Error when creating Swish request
sv_se: Fel uppstod vid skapandet av Swish-anrop

source: Payment reference required for refund is missing on order %s
sv_se: Betalningsreferens som krävs för återbetalnings saknas för order %s

source: Transaction failed to retreive from Swish
sv_se: Misslyckades att hämta transaktionen från Swish

source: Transaction retreived from Swish
sv_se: Transaktion hämtad från Swish

source: Refund to customer confirmed - %s ID: %s
sv_se: Bekräftad återbetalning till kund - %s ID: %s

source: This is the placeholder for the field where the customer enters their Swish (mobile) number.
sv_se: Detta är en placeholder för fältet där kunder anger sina Swish/mobil-nummer

source: Mobile number placeholder
sv_se: Placeholder för mobilnummer

source: Congratulations! You can now be live with Swish payments within minutes. Go to the <a href="%s">configuration page</a> and select BjornTech as Technical Supplier as your connection type.
sv_se: Grattis! Du kan nu gå live med Swish-betalningar inom kort. Gå till <a href="%s">sidan för inställningar</a> och välj Bjorntech som Teknisk Leverantör som anslutningstyp.

source: Congratulations! You can now be live with Swish payments within minutes. Read the <a href="https://bjorntech.com/sv/swish-teknisk-leverantor?utm_source=wp-swish&utm_medium=plugin&utm_campaign=product" target="_blank" rel="noopener">instructions</a> on how to set it in your Bank. Then select BjornTech as Technical Supplier as your connection type.
sv_se: Grattis! Du kan nu gå live med Swish-betalningar inom kort. Läs <a href="https://bjorntech.com/sv/swish-teknisk-leverantor?utm_source=wp-swish&utm_medium=plugin&utm_campaign=product" target="_blank" rel="noopener">instruktionerna</a> om hur du lägger upp detta hos din bank. Välj sedan Bjorntech som Teknisk Leverantör som anslutningstyp.

source: Plain checkout
sv_se: Enkel checkout

source: Thank you. Your order has been received.
sv_se: Tack. Vi har tagit emot din beställning.

source: Set the limit (1-99) required for purchasing this product via Swish. Leave blank or set to 0 for no limit.
sv_se: Ange en minimiålder (1-99) som krävs för att köpa denna produkt via Swish. Lämna blankt eller sätt till 0 om inget ålderskrav finns.

source: Age limit
sv_se: Minimiålder

source: Enter an age between 1 and 99
sv_se: Ange en ålder mellan 1 och 99

source: Legacy checkout
sv_se: Äldre checkout

source: Set if you want to set an age limit to persons that should be allowed to purchase items in your shop, leave blank or set to 0 for no limit.
sv_se: Ange om du vill sätta en minimiålder för personer som skall kunna handla i din Webshop, lämna blank eller ange 0 om ingen gräns finns.

source: Site age limit
sv_se: Ange åldersgräns

source: If enabled, you can set product age limits on individual products in the new Swish tab on products.
sv_se: Ange om du vill kunna sätta minimiålder i den nya Swish-fliken på produkter.

source: Product age limit
sv_se: Åldersgräns för produkter

source: The payer alias in the request is not enroled in swish with the supplied ssn
sv_se: Betalarens Swishnummer stämmer inte med personnummer för transaktionen.

source: The Swish-user does not meet the required age limit
sv_se: Betalarens ålder är inte tillräcklig för att genomföra transaktionen.

source: Invalid age format
sv_se: Ogiltligt format på ålder

source: Swish is using a callback and the server must be reachable from internet to work.
sv_se: Swish använder sig av en callback och din server måste därför vara nåbar från internet för att fungera.

source: Retrieve payment
sv_se: Hämta betalning

source: Read more about the different connection options <a href="https://bjorntech.com/sv/swish-handel?utm_source=wp-swish&utm_medium=plugin&utm_campaign=product">here</a><br>When using BjornTech as Technical provider you agree to our <a href="https://bjorntech.com/privacy-policy?utm_source=wp-swish&utm_medium=plugin&utm_campaign=product" target="_blank" rel="noopener">privacy policy</a>.
sv_se: Det finns flera sätt att ansluta tillägget till Swish. Läs mer om de olika alternativen <a href="https://bjorntech.com/sv/swish-handel?utm_source=wp-swish&utm_medium=plugin&utm_campaign=product">här</a><br>När du använder BjornTech som teknisk leverantör godkänner du vår <a href="https://bjorntech.com/privacy-policy?utm_source=wp-swish&utm_medium=plugin&utm_campaign=product" target="_blank" rel="noopener">integritetspolicy</a>.

source: Swish Payment
sv_se: Swish-betalning

source: Congratulations! Your Swish-plugin is now upgraded. You can continue using it as normal. In this version you can use BjornTech as Technical Supplier, read more <a href="https://bjorntech.com/sv/swish-teknisk-leverantor?utm_source=wp-swish&utm_medium=plugin&utm_campaign=product">here</a>
sv_se: Grattis! Ditt Swish-tillägg är uppdaterat. Du kan använda det som vanligt. I den här versionen kan du använda BjornTech som teknisk leverantör, läs mer <a href="https://bjorntech.com/sv/swish-teknisk-leverantor?utm_source=wp-swish&utm_medium=plugin&utm_campaign=product">här</a>

source: Your certificate %s expires %s. Take the opportunity to start using us as your Technical supplier. Read more <a href="https://bjorntech.com/sv/swish-teknisk-leverantor?utm_source=wp-swish&utm_medium=plugin&utm_campaign=product">here</a>
sv_se: Ditt certifikat %s slutar fungera %s. Ta tillfället i akt och använd oss som teknisk leverantör istället för att skapa ett nytt certifikat. Läs mer <a href="https://bjorntech.com/sv/swish-teknisk-leverantor?utm_source=wp-swish&utm_medium=plugin&utm_campaign=product">här</a>

source: Your certificate %s expired %s. Take the opportunity to start using us as your Technical supplier. Read more <a href="https://bjorntech.com/sv/swish-teknisk-leverantor?utm_source=wp-swish&utm_medium=plugin&utm_campaign=product">here</a>
sv_se: Ditt certifikat %s slutade fungera %s. Ta tillfället i akt och använd oss som teknisk leverantör istället för att skapa ett nytt certifikat. Läs mer <a href="https://bjorntech.com/sv/swish-teknisk-leverantor?utm_source=wp-swish&utm_medium=plugin&utm_campaign=product">här</a>

source: This is the label for the field where the customer enters their Swish (mobile) number.
sv_se: Detta är etiketten för det fält där kunden ska skriva in sitt Swishnummer (mobilnr).

source: Mobile number label
sv_se: Etikett för mobilnummer

source: You are running Swish e-commerce in test mode, use 4671234768 to test a payment
sv_se: Du använder Swish e-commerce i testläge, använd 4671234768 för att genomföra en testbetalning

source: Select methods
sv_se: Välj metoder

# Order status
source: Completed
sv_se: Färdigbehandlad

# Order status
source: Processing
sv_se: Behandlas

source: Let WooCommerce settings decide
sv_se: Låt WooCommerce avgöra

source: Set the preferred order state for an order that is successfully paid.
sv_se: Ange önskad orderstatus för en betald order.

source: Order status when paid
sv_se: Orderstatus efter betalning

source: Your system is using NSS. The plugin can be configured to work with NSS but this requires deep NSS knowledge. If you do not have this knowledge we do recommend to use our service as Technical supplier.
sv_se: Ditt system använder NSS. Tillägget kan konfigureras för att fungera med NSS men detta kräver djup kunskap om NSS. Om du inte har denna kunskap rekommenderar vi att du använder vår tjänst som teknisk leverantör istället.

source: Error processing the payment. Contact the shop support
sv_se: Fel vid behandning av betalningen. Kontakta butikens support.

source: BankID is not able to authorize the payment
sv_se: BankID kan inte auktorisera betalningen

source: BankID already in use.
sv_se: BankID används på annan plats.

source: Swish timed out waiting for an answer from the banks. Check with your bank about the status of this payment
sv_se: Swish uppnådde en tidsgräns i väntan på svar från bankerna. Kontrollera status på betalningen hos din bank.

source: Payment
sv_se: Betalning

source: Test-payment
sv_se: Testbetalning

source: The "Swish Handel" number must start with 123, be 10 digits long and not contain any spaces.
sv_se: Ditt Swish Handel kontonummer måste börja med 123, vara 10 tecken långt och endast innehålla siffror.

source: You are about to disconnect BjornTech as Technical Supplier
sv_se: Du slutar nu att använda BjornTech som Teknisk Leverantör

source: I agree to the BjornTech Privacy Policy
sv_se: Jag godkänner BjornTech personuppgiftspolicy

source: You have to use a "Swish Handel" account and select BjornTech as Technical Supplier in your Bank for the service to work
sv_se: Du måste använda ett Swish Handel konto och välja BjornTech som din Tekniska Leverantör hos din Bank för att tjänsten skall fungera.

source: The Swish-number to receive payments. The number must be a Swish Handel account. A private Swish-number or a Swish Corporate number does not work.
sv_se: Swish-numret som du vill använda. Numret måste vara av typen "Swish Handel. Ett privat Swish-nummer eller ett Swish företag fungerar inte.

source: Your Swish-number
sv_se: Ditt Swish-nummer

source: Connect to BjornTech as Technical Supplier
sv_se: Anslut BjornTech som Teknisk Leverantör

source: Disconnect from BjornTech as Technical Supplier
sv_se: Koppla ifrån BjornTech som Teknisk Leverantör

source: You are using BjornTech as Technical Supplier
sv_se: Du använder BjornTech som Teknisk Leverantör

source: BjornTech as Technical Supplier
sv_se: BjornTech som Teknisk Leverantör

source: Unknown error occured when communicating with Swish
sv_se: Ett okänt fel uppstod vid kommunikation med Swish

source: Select the type of checkout you want the user to see. The modal checkout does not work with all themes.
sv_se: Välj vilken typ av kassa du vill visa kunden. Modal checkout fungerar inte i alla teman.

source: Turn on logging for debug purposes.
sv_se: Slå på loggning för felsökning

source: Enable debug-log
sv_se: Aktivera debug-log

source: Select type of checkout
sv_se: Välj typ av checkout

source: Connect
sv_se: Anslut

source: The address where to send the confirmation mail address
sv_se: Adressen dit vi skickar bekräftelsemailet vid anslutning

source: Account mail address
sv_se: Kontots mailadress

source: Disconnect
sv_se: Koppla bort

source: Local Swish certificate
sv_se: Lokalt Swish certifikat

source: Select connection type
sv_se: Välj typ av anslutning

source: Connection type
sv_se: Anslutningstyp

source: Select your preferred way to connect
sv_se: Välj hur du vill ansluta

source: Enter nickname for the Swish certificate stored in your NSS database
sv_se: Ange alias för Swish-certifikatet som du har lagrat i NSS-databasen

source: Create a directory in a safe place on your server and place the certificate there
sv_se: Skapa ett bibliotek på en säker plats i din server och placera certifikatet där

source: Local Swish Certificate (using %s @ %s)
sv_se: Lokalt Swish certifikat (använder %s @ %s)

source: Another active request already exists for this swish number
sv_se: Det finns redan en begäran o betalning gjord för detta swish nummer

source: The link has now expired, please connect again to get a new link.
sv_se: Länken har slutat gälla, anslut igen för att få en ny länk.

source: We have sent a mail with the activation link. Click on the link to activate the service.
sv_se: Vi har skickat ett mail med en aktiveringslänk. Klicka på länken för att aktivera tjänsten.

source: The activation of the account failed
sv_se: Aktiveringen av kontot misslyckades.

source: Succcessfully disconnected from the certificate service
sv_se: Du är nu bortkopplad från certifikatservicen

source: Something went wrong when trying to disconnect from the certificate service
sv_se: Något gick fel när certifkatsservicen skulle avslutas

source: Something went wrong when trying to connect to the BjornTech service.
sv_se: Något gick fel vid anslutning till BjornTech Certifikat Service

source: Enter the address to where the verification mail is sent and save the page before connecting.
sv_se: Välj vilken adress som verifikationsmailet skall skickas till och spara sidan innan du ansluter,

source: Enter your "Swish Handel" number and save the page before connecting.
sv_se: Ange ditt Swish Handel nummer och spara sidan innan du ansluter

source: The site must be configured with https to work with Swish.
sv_se: Sidan måste vara konfigurerad med https för att fungera med Swish

source: Receive payments using Swish e-commerce.
sv_se: Ta emot betalningar genom Swish Handel

source: Enter your Swish-number and press Process. After that you open your Swish-app and authorize the payment that we sent to your app.
sv_se: Fyll i ditt Swish-nummer och tryck på Slutför köp. Sedan öppnar du din Swish-app och genomför betalningen som vi skickat till appen.

source: NSS database location
sv_se: NSS databasens placering

source: Payment confirmed - %s ID: %s
sv_se: Betalning bekräftad – %s ID: %s

source: Merchant account debited - %s ID: %s
sv_se: Handlarens konto debiterat – %s ID: %s

source: %s declined by user
sv_se: %s nekad av användare

source: Start Swish app
sv_se: Starta Swish-appen

source: Always show
sv_se: Visa alltid

source: Show when Wordpress detects a mobile device
sv_se: Visa när WordPress detekterar en mobil

source: Never show
sv_se: Visa aldrig

source: The user is presented with a button to click on in order to start the Swish-app if it is present on the device
sv_se: Om användaren klickar på "Starta Swish-appen" vid betalningstillfället så startas Swish-appen automatiskt

source: Show "Start Swish app" button in these cases
sv_se: Visa "Starta Swish-appen"

source: Not a valid swish number
sv_se: Ogiltigt swish nummer

source: Integrates <a href="https://www.getswish.se/foretag/vara-erbjudanden/#foretag_two" target="_blank">Swish e-commerce</a> into your WooCommerce installation.
sv_se: Möjliggör betalning med <a href="https://www.getswish.se/foretag/vara-erbjudanden/" target="_blank">Swish e-commerce</a> i din butik.

source: Payment %s initiated
sv_se: Betalning %s påbörjad

source: Settings
sv_se: Inställningar

source: Swish number
sv_se: Swish-nummer

source: Swish number can be maximum 15 characters long
sv_se: Swish-numret får inte vara längre än 15 siffror

source: Swish number must be at least 8 characters long
sv_se: Swish-numret måste vara minst 8 siffor långt

source: Swish number missing
sv_se: Swishnummer saknas

source: <strong>%s</strong> is mandatory.
sv_se: <strong>%s</strong> är obligatorisk

source: You have missing or incorrect settings. Go to the <a href="%s">settings page</a>.
sv_se: Du har inkompletta eller felaktiga inställningar. Gå till sidan för <a href="%s">inställningar</a>.

source: WooCommerce Swish e-commerce
sv_se: WooCommerce Swish Handel

source: Text that to be placed on the transaction (max 50 characters including customer number if selected above).
sv_se: Text som läggs på transaktionen (max 50 tecken inklusive kundnummer om valt ovan).

source: Text on transaction
sv_se: Meddelandetext

source: Add the customer number in the text field of the transaction
sv_se: Lägg till kundnummer i text-fältet på transaktionen

source: Add Customer number on transaction
sv_se: Lägg till kundnummer på transaktionen

source: Transaction setup
sv_se: Inställningar för transaktioner

source: If Swish is only available for certain methods, set it up here. Leave empty to enable for all methods.
sv_se: Om Swish enbart skall vara tillgänglig för vissa fraktmetoder så välj vilka här. Lämna tom för alla.

source: Enable for shipping methods
sv_se: Tillgänglig för fraktmetoder

source: This is the description which the user sees during checkout.
sv_se: Beskrivningen som kunden ser i kassan

source: Customer Message
sv_se: Kundmeddelande

source: This is the title which the user sees during checkout.
sv_se: Rubriken som kunden ser i kassan

source: Title
sv_se: Benämning

source: Shop setup
sv_se: Butikskonfigurering

source: Merchant Swish number
sv_se: Butikens Swish-nummer

source: Password for the private key, leave blank if no password
sv_se: Lösenord för den privata nyckeln, lämna blankt om inget lösenord.

source: Private Key Password
sv_se: Privat nyckel lösenord

source: Merchant Certificate
sv_se: Handlarens Certifikat

source: Enable Swish Payments
sv_se: Aktivera Swish Betalningar

source: Enable
sv_se: Aktivera

source: Other locations
sv_se: Andra platser

source: Any &quot;%1$s&quot; method
sv_se: Vilken ”%1$s”-metod som helst

source: Unknown error received from Swish
sv_se: Okänt fel från Swish

source: Original payment not found or original payment is more than than 13 months old
sv_se: Ursprungsbetalningen hittades ej eller är mer än 13 månader gammal

source: Check the payment with your Bank
sv_se: Kontrollera betalningen med din Bank

source: Swish timed out before the payment was started
sv_se: Swish uppnådde en tidsgräns innan betalningen startade

source: Bank system processing error
sv_se: Bearbetningsfel i bankens system

source: Payer cancelled BankId signing
sv_se: Bank-id signering avbruten

source: Transaction declined
sv_se: Transaktionen avvisad

source: An error has occured
sv_se: Ett fel har inträffat

source: Payment declined
sv_se: Betalningen avvisades

source: Start your Swish-App and authorize the payment
sv_se: Starta din Swish-app och godkänn betalningen

source: Payee not Enrolled
sv_se: Mottagaren finns ej i systemet

source: Counterpart is not activated
sv_se: Motparten är inte aktiverad

source: Payer not Enrolled
sv_se: Betalaren ej registrerad

source: Wrong formatted message
sv_se: Felaktigt formaterat meddelande

source: Invalid or missing currency
sv_se: Felaktig eller saknad valutakod

source: Amount value is too large
sv_se: Beloppet är för stort

source: Amount value is too low
sv_se: Beloppet är för litet

source: Amount value is missing or not a valid number
sv_se: Belopp saknas eller är inte angivet som ett giltigt talvärde

source: Payee alias is missing or empty
sv_se: Mottagarnummer saknas eller är tomt

source: Payer alias is invalid
sv_se: Butikens Swish-id är ogiltligt

source: Callback URL is missing or does not use Https
sv_se: Callback URL saknas eller använder inte Https

source: PayeePaymentReference is invalid
sv_se: Mottagarens betalningsreferens är ogiltlig

source: An error occured. For more information check out the <strong>%s</strong> logs inside <strong>WooCommerce -> System Status -> Logs</strong>.
sv_se: Ett problem har inträffat. För mer information se <strong>%s</strong> loggen under <strong>WooCommerce -> Status -> Loggar</strong>.

source: Customer number %s
sv_se: Kundnummer %s
